@api
Feature: Авторизация пользователя

  @smoke
  Scenario: Успешный вход
    Given пользователь зарегистрирован
    When пользователь входит в систему
    Then запрос выполнен успешно
    And в ответе есть непустой токен

  @smoke
  Scenario: Получение информации о текущем пользователе
    Given пользователь авторизован
    When пользователь запрашивает свой профиль
    Then запрос выполнен успешно
    And в профиле указан email пользователя

  Scenario: Доступ без токена
    Given неавторизованный пользователь
    When пользователь запрашивает свой профиль
    Then доступ отклонен с ошибкой "UNAUTHORIZED"