@api
Feature: Задачи

  Scenario: Полный жизненный цикл задачи в проекте DEMO
    Given пользователь авторизован

    When пользователь запрашивает список проектов
    Then найден проект "DEMO"

    When пользователь создает задачу с уникальным заголовком в проекте
    Then задача создана
    And статус задачи "TODO"
    And версия задачи 0

    When пользователь запрашивает задачу
    Then запрос выполнен успешно
    And заголовок задачи совпадает с заданным

    When пользователь переводит задачу в статус "IN_PROGRESS"
    Then запрос выполнен успешно
    And статус задачи "IN_PROGRESS"
    And версия задачи увеличилась

    When пользователь удаляет задачу
    Then задача удалена

    When пользователь запрашивает задачу
    Then задача не найдена с ошибкой "NOT_FOUND"